STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.h
/**
  ******************************************************************************
  * @file    stm32u5xx_hal_ucpd.h
  * @brief   Header file of UCPD HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U5XX_HAL_UCPD_H
#define STM32U5XX_HAL_UCPD_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal_def.h"
#include "stm32u5xx_ll_ucpd.h"
#include "stm32u5xx_ll_system.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

#if defined(UCPD1)

/** @defgroup UCPD UCPD
  * @{
  */

/* Exported constants ---------------------------------------------------------*/
/** @defgroup UCPD_Exported_Constants UCPD Exported Constants
  * @{
  */

#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
/** @defgroup  UCPD_Error_Code UCPD Group Error Code reflecting the processes asynchronous errors
  * @{
  */

#define  HAL_UCPD_ERROR_NONE   (0UL)        /*!< No error          */
#define  HAL_UCPD_ERROR_RXERR  (1UL << 0U)  /*!< Error Rx          */
#define  HAL_UCPD_ERROR_RXOVR  (1UL << 1U)  /*!< Error Rx overrun  */
#define  HAL_UCPD_ERROR_TXUND  (1UL << 2U)  /*!< Error Tx underrun */
#define  HAL_UCPD_ERROR_DMA    (1UL << 3U)  /*!< DMA error         */

/**
  * @}
  */

#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

/** @defgroup UCPD_Group_RXORDEREDSET UCPD Group Rx Ordered set
  * @{
  */

#define HAL_UCPD_RX_ORDERED_SET_SOP        LL_UCPD_RX_ORDERED_SET_SOP        /*!< SOP ordered set detection enabled         */
#define HAL_UCPD_RX_ORDERED_SET_SOP1       LL_UCPD_RX_ORDERED_SET_SOP1       /*!< SOP' ordered set detection enabled        */
#define HAL_UCPD_RX_ORDERED_SET_SOP2       LL_UCPD_RX_ORDERED_SET_SOP2       /*!< SOP'' ordered set detection enabled       */
#define HAL_UCPD_RX_ORDERED_SET_HARD_RST   LL_UCPD_RX_ORDERED_SET_HARDRST    /*!< Hard reset ordered set detection enabled  */
#define HAL_UCPD_RX_ORDERED_SET_CABLE_RST  LL_UCPD_RX_ORDERED_SET_CABLERST   /*!< Cable reset ordered set detection enabled */
#define HAL_UCPD_RX_ORDERED_SET_SOP1_DEBUG LL_UCPD_RX_ORDERED_SET_SOP1_DEBUG /*!< SOP' debug ordered set detection enabled  */
#define HAL_UCPD_RX_ORDERED_SET_SOP2_DEBUG LL_UCPD_RX_ORDERED_SET_SOP2_DEBUG /*!< SOP'' debug ordered set detection enabled */
#define HAL_UCPD_RX_ORDERED_SET_SOP_EXT1   LL_UCPD_RX_ORDERED_SET_SOP_EXT1   /*!< SOP ext#1 ordered set detection enabled   */
#define HAL_UCPD_RX_ORDERED_SET_SOP_EXT2   LL_UCPD_RX_ORDERED_SET_SOP_EXT2   /*!< SOP ext#2 ordered set detection enabled   */
#define HAL_UCPD_RX_ORDERED_SET_NONE       LL_UCPD_RX_ORDERED_SET_NONE       /*!< Ordered set detection disabled            */

/**
  * @}
  */

/** @defgroup UCPD_Group_RXMAXSIZE UCPD Group Rx max size
  * @{
  */

#define HAL_UCPD_RX_MAX_SIZE_CHUNKED   (30U)  /*!< Max size of possible chunked message reception   */
#define HAL_UCPD_RX_MAX_SIZE_UNCHUNKED (264U) /*!< Max size of possible unchunked message reception */

/**
  * @}
  */

/** @defgroup UCPD_Macro_CheckUpdateState UCPD Check update state macro
  * @{
  */

/** @brief Check the current peripheral handle state and move it to new state, and save the previous state
  *        in an atomic way.
  * @param handle Specifies the Peripheral Handle.
  * @param state_field Specifies the state field within the Handle.
  * @param ppp_conditional_state State to be checked to authorize moving to the new state.
  * @param ppp_new_state New state to be set.
  * @param old_state_field Specifies the previous state field within the Handle.
  * @note  This macro can be used for the following purpose:
  *        - When the define USE_HAL_CHECK_PROCESS_STATE is set to "1", this macro allows to check the current
  *          handle state versus a conditional state and if true set to the desired new state, and save the previous
  *          state.
  *          The check and update of the state and previous state is done using exclusive Load/store instruction making
  *          the operation atomic.
  *        - When the define USE_HAL_CHECK_PROCESS_STATE is not set to "1", this macro simply assign the new
  *          handle state field to the new desired state and sets the previous state without any check.
  * @retval HAL_BUSY if the define USE_HAL_CHECK_PROCESS_STATE is set to "1" and the current state doesn't match
  *         ppp_conditional_state.
  */
#if defined(USE_HAL_CHECK_PROCESS_STATE) && (USE_HAL_CHECK_PROCESS_STATE == 1)
#define UCPD_CHECK_UPDATE_STATE(handle, state_field, ppp_conditional_state, ppp_new_state, old_state_field)         \
  do {                                                                                                              \
    do {                                                                                                            \
      /* Return HAL_BUSY if the status is not ready */                                                              \
      if ((__LDREXW((volatile uint32_t *)((uint32_t)&(handle)->state_field)) &                                      \
           (uint32_t)(ppp_conditional_state)) == 0U)                                                                \
      {                                                                                                             \
        return HAL_BUSY;                                                                                            \
      }                                                                                                             \
      (handle)->old_state_field = (handle)->state_field;                                                            \
      /* If state is ready then attempt to change the state to the new one */                                       \
    } while (__STREXW((uint32_t)(ppp_new_state), (volatile uint32_t *)((uint32_t)&((handle)->state_field))) != 0U); \
    /* Do not start any other memory access until memory barrier is complete */                                     \
    __DMB();                                                                                                        \
  } while (0)
#else
#define UCPD_CHECK_UPDATE_STATE(handle, state_field, ppp_conditional_state, ppp_new_state, old_state_field)         \
  do {                                                                                                              \
    (handle)->old_state_field = (handle)->state_field;                                                              \
    (handle)->state_field     = (ppp_new_state);                                                                    \
  } while(0)
#endif /* USE_HAL_CHECK_PROCESS_STATE == 1 */

/**
  * @}
  */

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup  UCPD_Exported_Types UCPD Exported Types
  * @{
  */

/**
  * @brief UCPD States
  */
typedef enum
{
  HAL_UCPD_STATE_RESET       = 0U,          /*!< UCPD is not yet initialized                         */
  HAL_UCPD_STATE_INIT        = (1U << 31U), /*!< UCPD is initialized but not yet configured          */
  HAL_UCPD_STATE_CONFIGURED  = (1U << 30U), /*!< UCPD is initialized and a global config was applied */
  HAL_UCPD_STATE_IDLE        = (1U << 29U), /*!< UCPD is ready and configuration is locked           */
  HAL_UCPD_STATE_RX          = (1U << 28U), /*!< UCPD is in Rx mode                                  */
  HAL_UCPD_STATE_TX          = (1U << 27U), /*!< UCPD is in Tx mode                                  */
  HAL_UCPD_STATE_ABORT       = (1U << 26U), /*!< UCPD is aborting                                    */
} hal_ucpd_state_t;

/**
  * @brief UCPD Prescaler for producing ucpd_clk from ucpd_ker_ck
  */
typedef enum
{
  HAL_UCPD_PSC_DIV1  = LL_UCPD_PSC_DIV1, /*!< Divide kernel clock by 1  */
  HAL_UCPD_PSC_DIV2  = LL_UCPD_PSC_DIV2, /*!< Divide kernel clock by 2  */
  HAL_UCPD_PSC_DIV4  = LL_UCPD_PSC_DIV4, /*!< Divide kernel clock by 4  */
  HAL_UCPD_PSC_DIV8  = LL_UCPD_PSC_DIV8, /*!< Divide kernel clock by 8  */
  HAL_UCPD_PSC_DIV16 = LL_UCPD_PSC_DIV16,/*!< Divide kernel clock by 16 */
} hal_ucpd_clk_prescaler_t;

/**
  * @brief UCPD Divider for producing half-bit clock hbit_clk from ucpd_clk
  */
typedef enum
{
  HAL_UCPD_HBITCLK_DIV1  = LL_UCPD_HBITCLK_DIV1,  /*!< Bypass divider        */
  HAL_UCPD_HBITCLK_DIV2  = LL_UCPD_HBITCLK_DIV2,  /*!< Divide ucpd_clk by 2  */
  HAL_UCPD_HBITCLK_DIV3  = LL_UCPD_HBITCLK_DIV3,  /*!< Divide ucpd_clk by 3  */
  HAL_UCPD_HBITCLK_DIV4  = LL_UCPD_HBITCLK_DIV4,  /*!< Divide ucpd_clk by 4  */
  HAL_UCPD_HBITCLK_DIV5  = LL_UCPD_HBITCLK_DIV5,  /*!< Divide ucpd_clk by 5  */
  HAL_UCPD_HBITCLK_DIV6  = LL_UCPD_HBITCLK_DIV6,  /*!< Divide ucpd_clk by 6  */
  HAL_UCPD_HBITCLK_DIV7  = LL_UCPD_HBITCLK_DIV7,  /*!< Divide ucpd_clk by 7  */
  HAL_UCPD_HBITCLK_DIV8  = LL_UCPD_HBITCLK_DIV8,  /*!< Divide ucpd_clk by 8  */
  HAL_UCPD_HBITCLK_DIV9  = LL_UCPD_HBITCLK_DIV9,  /*!< Divide ucpd_clk by 9  */
  HAL_UCPD_HBITCLK_DIV10 = LL_UCPD_HBITCLK_DIV10, /*!< Divide ucpd_clk by 10 */
  HAL_UCPD_HBITCLK_DIV11 = LL_UCPD_HBITCLK_DIV11, /*!< Divide ucpd_clk by 11 */
  HAL_UCPD_HBITCLK_DIV12 = LL_UCPD_HBITCLK_DIV12, /*!< Divide ucpd_clk by 12 */
  HAL_UCPD_HBITCLK_DIV13 = LL_UCPD_HBITCLK_DIV13, /*!< Divide ucpd_clk by 13 */
  HAL_UCPD_HBITCLK_DIV14 = LL_UCPD_HBITCLK_DIV14, /*!< Divide ucpd_clk by 14 */
  HAL_UCPD_HBITCLK_DIV15 = LL_UCPD_HBITCLK_DIV15, /*!< Divide ucpd_clk by 15 */
  HAL_UCPD_HBITCLK_DIV16 = LL_UCPD_HBITCLK_DIV16, /*!< Divide ucpd_clk by 16 */
  HAL_UCPD_HBITCLK_DIV17 = LL_UCPD_HBITCLK_DIV17, /*!< Divide ucpd_clk by 17 */
  HAL_UCPD_HBITCLK_DIV18 = LL_UCPD_HBITCLK_DIV18, /*!< Divide ucpd_clk by 28 */
  HAL_UCPD_HBITCLK_DIV19 = LL_UCPD_HBITCLK_DIV19, /*!< Divide ucpd_clk by 19 */
  HAL_UCPD_HBITCLK_DIV20 = LL_UCPD_HBITCLK_DIV20, /*!< Divide ucpd_clk by 20 */
  HAL_UCPD_HBITCLK_DIV21 = LL_UCPD_HBITCLK_DIV21, /*!< Divide ucpd_clk by 21 */
  HAL_UCPD_HBITCLK_DIV22 = LL_UCPD_HBITCLK_DIV22, /*!< Divide ucpd_clk by 22 */
  HAL_UCPD_HBITCLK_DIV23 = LL_UCPD_HBITCLK_DIV23, /*!< Divide ucpd_clk by 23 */
  HAL_UCPD_HBITCLK_DIV24 = LL_UCPD_HBITCLK_DIV24, /*!< Divide ucpd_clk by 24 */
  HAL_UCPD_HBITCLK_DIV25 = LL_UCPD_HBITCLK_DIV25, /*!< Divide ucpd_clk by 25 */
  HAL_UCPD_HBITCLK_DIV26 = LL_UCPD_HBITCLK_DIV26, /*!< Divide ucpd_clk by 26 */
  HAL_UCPD_HBITCLK_DIV27 = LL_UCPD_HBITCLK_DIV27, /*!< Divide ucpd_clk by 27 */
  HAL_UCPD_HBITCLK_DIV28 = LL_UCPD_HBITCLK_DIV28, /*!< Divide ucpd_clk by 28 */
  HAL_UCPD_HBITCLK_DIV29 = LL_UCPD_HBITCLK_DIV29, /*!< Divide ucpd_clk by 29 */
  HAL_UCPD_HBITCLK_DIV30 = LL_UCPD_HBITCLK_DIV30, /*!< Divide ucpd_clk by 30 */
  HAL_UCPD_HBITCLK_DIV31 = LL_UCPD_HBITCLK_DIV31, /*!< Divide ucpd_clk by 31 */
  HAL_UCPD_HBITCLK_DIV32 = LL_UCPD_HBITCLK_DIV32, /*!< Divide ucpd_clk by 32 */
  HAL_UCPD_HBITCLK_DIV33 = LL_UCPD_HBITCLK_DIV33, /*!< Divide ucpd_clk by 33 */
  HAL_UCPD_HBITCLK_DIV34 = LL_UCPD_HBITCLK_DIV34, /*!< Divide ucpd_clk by 34 */
  HAL_UCPD_HBITCLK_DIV35 = LL_UCPD_HBITCLK_DIV35, /*!< Divide ucpd_clk by 35 */
  HAL_UCPD_HBITCLK_DIV36 = LL_UCPD_HBITCLK_DIV36, /*!< Divide ucpd_clk by 36 */
  HAL_UCPD_HBITCLK_DIV37 = LL_UCPD_HBITCLK_DIV37, /*!< Divide ucpd_clk by 37 */
  HAL_UCPD_HBITCLK_DIV38 = LL_UCPD_HBITCLK_DIV38, /*!< Divide ucpd_clk by 38 */
  HAL_UCPD_HBITCLK_DIV39 = LL_UCPD_HBITCLK_DIV39, /*!< Divide ucpd_clk by 39 */
  HAL_UCPD_HBITCLK_DIV40 = LL_UCPD_HBITCLK_DIV40, /*!< Divide ucpd_clk by 40 */
  HAL_UCPD_HBITCLK_DIV41 = LL_UCPD_HBITCLK_DIV41, /*!< Divide ucpd_clk by 41 */
  HAL_UCPD_HBITCLK_DIV42 = LL_UCPD_HBITCLK_DIV42, /*!< Divide ucpd_clk by 42 */
  HAL_UCPD_HBITCLK_DIV43 = LL_UCPD_HBITCLK_DIV43, /*!< Divide ucpd_clk by 43 */
  HAL_UCPD_HBITCLK_DIV44 = LL_UCPD_HBITCLK_DIV44, /*!< Divide ucpd_clk by 44 */
  HAL_UCPD_HBITCLK_DIV45 = LL_UCPD_HBITCLK_DIV45, /*!< Divide ucpd_clk by 45 */
  HAL_UCPD_HBITCLK_DIV46 = LL_UCPD_HBITCLK_DIV46, /*!< Divide ucpd_clk by 46 */
  HAL_UCPD_HBITCLK_DIV47 = LL_UCPD_HBITCLK_DIV47, /*!< Divide ucpd_clk by 47 */
  HAL_UCPD_HBITCLK_DIV48 = LL_UCPD_HBITCLK_DIV48, /*!< Divide ucpd_clk by 48 */
  HAL_UCPD_HBITCLK_DIV49 = LL_UCPD_HBITCLK_DIV49, /*!< Divide ucpd_clk by 49 */
  HAL_UCPD_HBITCLK_DIV50 = LL_UCPD_HBITCLK_DIV50, /*!< Divide ucpd_clk by 50 */
  HAL_UCPD_HBITCLK_DIV51 = LL_UCPD_HBITCLK_DIV51, /*!< Divide ucpd_clk by 51 */
  HAL_UCPD_HBITCLK_DIV52 = LL_UCPD_HBITCLK_DIV52, /*!< Divide ucpd_clk by 52 */
  HAL_UCPD_HBITCLK_DIV53 = LL_UCPD_HBITCLK_DIV53, /*!< Divide ucpd_clk by 53 */
  HAL_UCPD_HBITCLK_DIV54 = LL_UCPD_HBITCLK_DIV54, /*!< Divide ucpd_clk by 54 */
  HAL_UCPD_HBITCLK_DIV55 = LL_UCPD_HBITCLK_DIV55, /*!< Divide ucpd_clk by 55 */
  HAL_UCPD_HBITCLK_DIV56 = LL_UCPD_HBITCLK_DIV56, /*!< Divide ucpd_clk by 56 */
  HAL_UCPD_HBITCLK_DIV57 = LL_UCPD_HBITCLK_DIV57, /*!< Divide ucpd_clk by 57 */
  HAL_UCPD_HBITCLK_DIV58 = LL_UCPD_HBITCLK_DIV58, /*!< Divide ucpd_clk by 58 */
  HAL_UCPD_HBITCLK_DIV59 = LL_UCPD_HBITCLK_DIV59, /*!< Divide ucpd_clk by 59 */
  HAL_UCPD_HBITCLK_DIV60 = LL_UCPD_HBITCLK_DIV60, /*!< Divide ucpd_clk by 60 */
  HAL_UCPD_HBITCLK_DIV61 = LL_UCPD_HBITCLK_DIV61, /*!< Divide ucpd_clk by 61 */
  HAL_UCPD_HBITCLK_DIV62 = LL_UCPD_HBITCLK_DIV62, /*!< Divide ucpd_clk by 62 */
  HAL_UCPD_HBITCLK_DIV63 = LL_UCPD_HBITCLK_DIV63, /*!< Divide ucpd_clk by 63 */
  HAL_UCPD_HBITCLK_DIV64 = LL_UCPD_HBITCLK_DIV64  /*!< Divide ucpd_clk by 64 */
} hal_ucpd_half_bit_clk_divider_t;

/**
  * @brief UCPD Divider for producing transition window clock from hbit_clk
  */
typedef enum
{
  HAL_UCPD_TRANSWIN_DIVINVALID = LL_UCPD_TRANSWIN_DIVINVALID, /*!< Not supported         */
  HAL_UCPD_TRANSWIN_DIV2       = LL_UCPD_TRANSWIN_DIV2,       /*!< Divide hbit_clk by 2  */
  HAL_UCPD_TRANSWIN_DIV3       = LL_UCPD_TRANSWIN_DIV3,       /*!< Divide hbit_clk by 3  */
  HAL_UCPD_TRANSWIN_DIV4       = LL_UCPD_TRANSWIN_DIV4,       /*!< Divide hbit_clk by 4  */
  HAL_UCPD_TRANSWIN_DIV5       = LL_UCPD_TRANSWIN_DIV5,       /*!< Divide hbit_clk by 5  */
  HAL_UCPD_TRANSWIN_DIV6       = LL_UCPD_TRANSWIN_DIV6,       /*!< Divide hbit_clk by 6  */
  HAL_UCPD_TRANSWIN_DIV7       = LL_UCPD_TRANSWIN_DIV7,       /*!< Divide hbit_clk by 7  */
  HAL_UCPD_TRANSWIN_DIV8       = LL_UCPD_TRANSWIN_DIV8,       /*!< Divide hbit_clk by 8  */
  HAL_UCPD_TRANSWIN_DIV9       = LL_UCPD_TRANSWIN_DIV9,       /*!< Divide hbit_clk by 9  */
  HAL_UCPD_TRANSWIN_DIV10      = LL_UCPD_TRANSWIN_DIV10,      /*!< Divide hbit_clk by 10 */
  HAL_UCPD_TRANSWIN_DIV11      = LL_UCPD_TRANSWIN_DIV11,      /*!< Divide hbit_clk by 11 */
  HAL_UCPD_TRANSWIN_DIV12      = LL_UCPD_TRANSWIN_DIV12,      /*!< Divide hbit_clk by 12 */
  HAL_UCPD_TRANSWIN_DIV13      = LL_UCPD_TRANSWIN_DIV13,      /*!< Divide hbit_clk by 13 */
  HAL_UCPD_TRANSWIN_DIV14      = LL_UCPD_TRANSWIN_DIV14,      /*!< Divide hbit_clk by 14 */
  HAL_UCPD_TRANSWIN_DIV15      = LL_UCPD_TRANSWIN_DIV15,      /*!< Divide hbit_clk by 15 */
  HAL_UCPD_TRANSWIN_DIV16      = LL_UCPD_TRANSWIN_DIV16,      /*!< Divide hbit_clk by 16 */
  HAL_UCPD_TRANSWIN_DIV17      = LL_UCPD_TRANSWIN_DIV17,      /*!< Divide hbit_clk by 17 */
  HAL_UCPD_TRANSWIN_DIV18      = LL_UCPD_TRANSWIN_DIV18,      /*!< Divide hbit_clk by 28 */
  HAL_UCPD_TRANSWIN_DIV19      = LL_UCPD_TRANSWIN_DIV19,      /*!< Divide hbit_clk by 19 */
  HAL_UCPD_TRANSWIN_DIV20      = LL_UCPD_TRANSWIN_DIV20,      /*!< Divide hbit_clk by 20 */
  HAL_UCPD_TRANSWIN_DIV21      = LL_UCPD_TRANSWIN_DIV21,      /*!< Divide hbit_clk by 21 */
  HAL_UCPD_TRANSWIN_DIV22      = LL_UCPD_TRANSWIN_DIV22,      /*!< Divide hbit_clk by 22 */
  HAL_UCPD_TRANSWIN_DIV23      = LL_UCPD_TRANSWIN_DIV23,      /*!< Divide hbit_clk by 23 */
  HAL_UCPD_TRANSWIN_DIV24      = LL_UCPD_TRANSWIN_DIV24,      /*!< Divide hbit_clk by 24 */
  HAL_UCPD_TRANSWIN_DIV25      = LL_UCPD_TRANSWIN_DIV25,      /*!< Divide hbit_clk by 25 */
  HAL_UCPD_TRANSWIN_DIV26      = LL_UCPD_TRANSWIN_DIV26,      /*!< Divide hbit_clk by 26 */
  HAL_UCPD_TRANSWIN_DIV27      = LL_UCPD_TRANSWIN_DIV27,      /*!< Divide hbit_clk by 27 */
  HAL_UCPD_TRANSWIN_DIV28      = LL_UCPD_TRANSWIN_DIV28,      /*!< Divide hbit_clk by 28 */
  HAL_UCPD_TRANSWIN_DIV29      = LL_UCPD_TRANSWIN_DIV29,      /*!< Divide hbit_clk by 29 */
  HAL_UCPD_TRANSWIN_DIV30      = LL_UCPD_TRANSWIN_DIV30,      /*!< Divide hbit_clk by 30 */
  HAL_UCPD_TRANSWIN_DIV31      = LL_UCPD_TRANSWIN_DIV31,      /*!< Divide hbit_clk by 31 */
  HAL_UCPD_TRANSWIN_DIV32      = LL_UCPD_TRANSWIN_DIV32       /*!< Divide hbit_clk by 32 */
} hal_ucpd_transition_window_divider_t;

/**
  * @brief UCPD Divider for producing inter-frame gap timer clock from ucpd_clk
  */
typedef enum
{
  HAL_UCPD_IFRGAP_DIVINVALID = LL_UCPD_IFRGAP_DIVINVALID, /*!< Not supported         */
  HAL_UCPD_IFRGAP_DIV2       = LL_UCPD_IFRGAP_DIV2,       /*!< Divide ucpd_clk by 2  */
  HAL_UCPD_IFRGAP_DIV3       = LL_UCPD_IFRGAP_DIV3,       /*!< Divide ucpd_clk by 3  */
  HAL_UCPD_IFRGAP_DIV4       = LL_UCPD_IFRGAP_DIV4,       /*!< Divide ucpd_clk by 4  */
  HAL_UCPD_IFRGAP_DIV5       = LL_UCPD_IFRGAP_DIV5,       /*!< Divide ucpd_clk by 5  */
  HAL_UCPD_IFRGAP_DIV6       = LL_UCPD_IFRGAP_DIV6,       /*!< Divide ucpd_clk by 6  */
  HAL_UCPD_IFRGAP_DIV7       = LL_UCPD_IFRGAP_DIV7,       /*!< Divide ucpd_clk by 7  */
  HAL_UCPD_IFRGAP_DIV8       = LL_UCPD_IFRGAP_DIV8,       /*!< Divide ucpd_clk by 8  */
  HAL_UCPD_IFRGAP_DIV9       = LL_UCPD_IFRGAP_DIV9,       /*!< Divide ucpd_clk by 9  */
  HAL_UCPD_IFRGAP_DIV10      = LL_UCPD_IFRGAP_DIV10,      /*!< Divide ucpd_clk by 10 */
  HAL_UCPD_IFRGAP_DIV11      = LL_UCPD_IFRGAP_DIV11,      /*!< Divide ucpd_clk by 11 */
  HAL_UCPD_IFRGAP_DIV12      = LL_UCPD_IFRGAP_DIV12,      /*!< Divide ucpd_clk by 12 */
  HAL_UCPD_IFRGAP_DIV13      = LL_UCPD_IFRGAP_DIV13,      /*!< Divide ucpd_clk by 13 */
  HAL_UCPD_IFRGAP_DIV14      = LL_UCPD_IFRGAP_DIV14,      /*!< Divide ucpd_clk by 14 */
  HAL_UCPD_IFRGAP_DIV15      = LL_UCPD_IFRGAP_DIV15,      /*!< Divide ucpd_clk by 15 */
  HAL_UCPD_IFRGAP_DIV16      = LL_UCPD_IFRGAP_DIV16,      /*!< Divide ucpd_clk by 16 */
  HAL_UCPD_IFRGAP_DIV17      = LL_UCPD_IFRGAP_DIV17,      /*!< Divide ucpd_clk by 17 */
  HAL_UCPD_IFRGAP_DIV18      = LL_UCPD_IFRGAP_DIV18,      /*!< Divide ucpd_clk by 28 */
  HAL_UCPD_IFRGAP_DIV19      = LL_UCPD_IFRGAP_DIV19,      /*!< Divide ucpd_clk by 19 */
  HAL_UCPD_IFRGAP_DIV20      = LL_UCPD_IFRGAP_DIV20,      /*!< Divide ucpd_clk by 20 */
  HAL_UCPD_IFRGAP_DIV21      = LL_UCPD_IFRGAP_DIV21,      /*!< Divide ucpd_clk by 21 */
  HAL_UCPD_IFRGAP_DIV22      = LL_UCPD_IFRGAP_DIV22,      /*!< Divide ucpd_clk by 22 */
  HAL_UCPD_IFRGAP_DIV23      = LL_UCPD_IFRGAP_DIV23,      /*!< Divide ucpd_clk by 23 */
  HAL_UCPD_IFRGAP_DIV24      = LL_UCPD_IFRGAP_DIV24,      /*!< Divide ucpd_clk by 24 */
  HAL_UCPD_IFRGAP_DIV25      = LL_UCPD_IFRGAP_DIV25,      /*!< Divide ucpd_clk by 25 */
  HAL_UCPD_IFRGAP_DIV26      = LL_UCPD_IFRGAP_DIV26,      /*!< Divide ucpd_clk by 26 */
  HAL_UCPD_IFRGAP_DIV27      = LL_UCPD_IFRGAP_DIV27,      /*!< Divide ucpd_clk by 27 */
  HAL_UCPD_IFRGAP_DIV28      = LL_UCPD_IFRGAP_DIV28,      /*!< Divide ucpd_clk by 28 */
  HAL_UCPD_IFRGAP_DIV29      = LL_UCPD_IFRGAP_DIV29,      /*!< Divide ucpd_clk by 29 */
  HAL_UCPD_IFRGAP_DIV30      = LL_UCPD_IFRGAP_DIV30,      /*!< Divide ucpd_clk by 30 */
  HAL_UCPD_IFRGAP_DIV31      = LL_UCPD_IFRGAP_DIV31,      /*!< Divide ucpd_clk by 31 */
  HAL_UCPD_IFRGAP_DIV32      = LL_UCPD_IFRGAP_DIV32       /*!< Divide ucpd_clk by 32 */
} hal_ucpd_inter_frame_gap_divider_t;

/**
  * @brief UCPD Tx ordered set configuration
  */
typedef enum
{
  HAL_UCPD_TX_ORDERED_SET_SOP        = LL_UCPD_TX_ORDERED_SET_SOP,         /*!< SOP message type         */
  HAL_UCPD_TX_ORDERED_SET_SOP1       = LL_UCPD_TX_ORDERED_SET_SOP1,        /*!< SOP' message type        */
  HAL_UCPD_TX_ORDERED_SET_SOP2       = LL_UCPD_TX_ORDERED_SET_SOP2,        /*!< SOP'' message type       */
  HAL_UCPD_TX_ORDERED_SET_HARD_RST   = LL_UCPD_TX_ORDERED_SET_HARD_RESET,  /*!< Hard reset message type  */
  HAL_UCPD_TX_ORDERED_SET_CABLE_RST  = LL_UCPD_TX_ORDERED_SET_CABLE_RESET, /*!< Cable reset message type */
  HAL_UCPD_TX_ORDERED_SET_SOP1_DEBUG = LL_UCPD_TX_ORDERED_SET_SOP1_DEBUG,  /*!< SOP' message type        */
  HAL_UCPD_TX_ORDERED_SET_SOP2_DEBUG = LL_UCPD_TX_ORDERED_SET_SOP2_DEBUG,  /*!< SOP'' message type       */
} hal_ucpd_tx_ordered_set_t;

/**
  * @brief UCPD Rx ordered set detected
  */
typedef enum
{
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOP         = LL_UCPD_RX_ORDERED_SET_DETECT_SOP,         /*!< SOP detected         */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOP1        = LL_UCPD_RX_ORDERED_SET_DETECT_SOP1,        /*!< SOP' detected        */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOP2        = LL_UCPD_RX_ORDERED_SET_DETECT_SOP2,        /*!< SOP'' detected       */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOP1_DEBUG  = LL_UCPD_RX_ORDERED_SET_DETECT_SOP1_DEBUG,  /*!< SOP' debug detected  */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOP2_DEBUG  = LL_UCPD_RX_ORDERED_SET_DETECT_SOP2_DEBUG,  /*!< SOP'' debug detected */
  HAL_UCPD_RX_ORDERED_SET_DETECT_CABLE_RESET = LL_UCPD_RX_ORDERED_SET_DETECT_CABLE_RESET, /*!< Cable reset detected */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOPEXT1     = LL_UCPD_RX_ORDERED_SET_DETECT_SOPEXT1,     /*!< SOP ext#1 detected   */
  HAL_UCPD_RX_ORDERED_SET_DETECT_SOPEXT2     = LL_UCPD_RX_ORDERED_SET_DETECT_SOPEXT2,     /*!< SOP ext#2 detected   */
} hal_ucpd_detected_rx_ordered_set_t;

/**
  * @brief UCPD TX mode
  */
typedef enum
{
  HAL_UCPD_TX_MODE_NORMAL      = LL_UCPD_TXMODE_NORMAL,       /*!< Tx mode normal      */
  HAL_UCPD_TX_MODE_CABLE_RESET = LL_UCPD_TXMODE_CABLE_RESET,  /*!< Tx mode cable reset */
  HAL_UCPD_TX_MODE_BIST        = LL_UCPD_TXMODE_BIST_CARRIER2 /*!< Tx mode BIST        */
} hal_ucpd_tx_mode_t;

/**
  * @brief UCPD Rx mode
  */
typedef enum
{
  HAL_UCPD_RX_MODE_NORMAL = LL_UCPD_RXMODE_NORMAL,        /*!< Rx mode normal */
  HAL_UCPD_RX_MODE_BIST   = LL_UCPD_RXMODE_BIST_TEST_DATA /*!< Rx mode BIST   */
} hal_ucpd_rx_mode_t;

/**
  * @brief UCPD Analog PHY operating role
  */
typedef enum
{
  HAL_UCPD_ROLE_SOURCE = LL_UCPD_ROLE_SRC, /*!< Source role */
  HAL_UCPD_ROLE_SINK   = LL_UCPD_ROLE_SNK  /*!< Sink role   */
} hal_ucpd_role_t;

/**
  * @brief UCPD Rp resistor values
  */
typedef enum
{
  HAL_UCPD_RP_DEFAULT = LL_UCPD_RESISTOR_DEFAULT, /*!< Rp resistor default USB value */
  HAL_UCPD_RP_1_5A    = LL_UCPD_RESISTOR_1_5A,    /*!< Rp resistor 1.5A value        */
  HAL_UCPD_RP_3_0A    = LL_UCPD_RESISTOR_3_0A,    /*!< Rp resistor 3.0A value        */
  HAL_UCPD_RP_NONE    = LL_UCPD_RESISTOR_NONE     /*!< no Rp resistor                */
} hal_ucpd_rp_value_t;

/**
  * @brief UCPD CC line enable
  */
typedef enum
{
  HAL_UCPD_CC_ENABLE_NONE   = LL_UCPD_CCENABLE_NONE,  /*!< Both CC1 and CC2 PHYs disabled */
  HAL_UCPD_CC_ENABLE_CC1    = LL_UCPD_CCENABLE_CC1,   /*!< CC1 PHY enabled                */
  HAL_UCPD_CC_ENABLE_CC2    = LL_UCPD_CCENABLE_CC2,   /*!< CC2 PHY enabled                */
  HAL_UCPD_CC_ENABLE_CC1CC2 = LL_UCPD_CCENABLE_CC1CC2 /*!< Both CC1 and CC2 PHYs enabled  */
} hal_ucpd_cc_enable_t;

/**
  * @brief UCPD BMC decoder Rx pre-filter sampling method
  */
typedef enum
{
  HAL_UCPD_RX_PREFILTER_3SAMPLES = LL_UCPD_RX_PREFILTER_3SAMPLES, /*!< 3 samples method for BMC decoder Rx pre-filter */
  HAL_UCPD_RX_PREFILTER_2SAMPLES = LL_UCPD_RX_PREFILTER_2SAMPLES  /*!< 2 samples method for BMC decoder Rx pre-filter */
} hal_ucpd_rx_prefilter_samples_t;

