STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.h
/**
  * @brief UCPD Global configuration
  */
typedef struct
{
  hal_ucpd_clk_prescaler_t             clk_psc;        /*!< Pre-scaler for generating ucpd_clk                       */
  hal_ucpd_half_bit_clk_divider_t      hbitclk_div;    /*!< Division ratio for producing half-bit clock              */
  hal_ucpd_transition_window_divider_t transwin_div;   /*!< Division ratio for producing transition window clock     */
  hal_ucpd_inter_frame_gap_divider_t   ifrgap_div;     /*!< Division ratio for producing inter-frame gap timer clock */
  uint32_t                             rx_ordered_set; /*!< Receiver accepted ordered set types. This variable is a
                                                            bitfield of type @ref UCPD_Group_RXORDEREDSET            */
} hal_ucpd_config_t;

/**
  * @brief UCPD Rp resistor values for trimming
  */
typedef enum
{
  HAL_UCPD_TRIM_RP_1_5A    = LL_UCPD_RESISTOR_1_5A,    /*!< Rp resistor 1.5A value for trimming */
  HAL_UCPD_TRIM_RP_3_0A    = LL_UCPD_RESISTOR_3_0A,    /*!< Rp resistor 3.0A value for trimming */
} hal_ucpd_trim_rp_value_t;


/**
  * @brief UCPD Rx PHY status
  */
typedef enum
{
  HAL_UCPD_RX_PHY_DISABLED = 0U, /*!< Rx PHY disabled */
  HAL_UCPD_RX_PHY_ENABLED  = 1U  /*!< Rx PHY enabled  */
} hal_ucpd_rx_phy_status_t;

/**
  * @brief UCPD Type-C detector status
  */
typedef enum
{
  HAL_UCPD_TYPE_C_DETECTOR_DISABLED = 0U, /*!< Type-C detector disabled */
  HAL_UCPD_TYPE_C_DETECTOR_ENABLED  = 1U  /*!< Type-C detector enabled  */
} hal_ucpd_type_c_detector_status_t;

/**
  * @brief UCPD Vconn discharge status
  */
typedef enum
{
  HAL_UCPD_VCONN_DISCHARGE_DISABLED = 0U, /*!< Vconn discharge disabled */
  HAL_UCPD_VCONN_DISCHARGE_ENABLED  = 1U  /*!< Vconn discharge enabled  */
} hal_ucpd_vconn_discharge_status_t;

/**
  * @brief UCPD Rx analog filter status
  */
typedef enum
{
  HAL_UCPD_RX_ANALOG_FILTER_DISABLED = 0U, /*!< Rx analog filter disabled */
  HAL_UCPD_RX_ANALOG_FILTER_ENABLED  = 1U  /*!< Rx analog filter enabled  */
} hal_ucpd_rx_analog_filter_status_t;

/**
  * @brief UCPD Wake-up from stop mode status
  */
typedef enum
{
  HAL_UCPD_WAKEUP_MODE_DISABLED = 0U, /*!< Wake-up from Stop mode disabled */
  HAL_UCPD_WAKEUP_MODE_ENABLED  = 1U  /*!< Wake-up from Stop mode enabled  */
} hal_ucpd_wakeup_mode_status_t;

/**
  * @brief UCPD ClkReq clock request forcing status
  */
typedef enum
{
  HAL_UCPD_FORCE_CLOCK_DISABLED = 0U, /*!< ClkReq clock request forcing disabled */
  HAL_UCPD_FORCE_CLOCK_ENABLED  = 1U  /*!< ClkReq clock request forcing enabled  */
} hal_ucpd_force_clk_status_t;

/**
  * @brief UCPD Rx pre-filter status
  */
typedef enum
{
  HAL_UCPD_RX_PREFILTER_DISABLED = 0U, /*!< Rx pre-filter disabled */
  HAL_UCPD_RX_PREFILTER_ENABLED  = 1U  /*!< Rx pre-filter enabled  */
} hal_ucpd_rx_prefilter_status_t;

/**
  * @brief UCPD CC lines
  */
typedef enum
{
  HAL_UCPD_LINE_CC1    = LL_UCPD_CCPIN_CC1,                       /*!< CC1 line */
  HAL_UCPD_LINE_CC2    = LL_UCPD_CCPIN_CC2,                       /*!< CC2 line */
  HAL_UCPD_LINE_CC1CC2 = (LL_UCPD_CCPIN_CC2 | LL_UCPD_CCPIN_CC2)  /*!< CC1 and CC2 lines */
} hal_ucpd_cc_line_t;

/**
  * @brief UCPD Fast Role Swap Rx status
  */
typedef enum
{
  HAL_UCPD_FRS_RX_DISABLED = 0U, /*!< Fast Role Swap Rx disabled */
  HAL_UCPD_FRS_RX_ENABLED  = 1U  /*!< Fast Role Swap Rx enabled  */
} hal_ucpd_frs_rx_status_t;


/**
  * @brief UCPD Hard reset reception status
  */
typedef enum
{
  HAL_UCPD_HARD_RESET_RX_DISABLED = 0U, /*!< Hard reset reception disabled */
  HAL_UCPD_HARD_RESET_RX_ENABLED  = 1U  /*!< Hard reset reception enabled  */
} hal_ucpd_hard_reset_rx_status_t;

/**
  * @brief UCPD Voltage state on CCx line in sink or source mode.
  */
typedef enum
{
  HAL_UCPD_VSTATE_SRC_VRA      = 0U, /*!< CCx voltage corresponds to an Ra state when current mode is source         */
  HAL_UCPD_VSTATE_SRC_VRD      = 1U, /*!< CCx voltage corresponds to an Rd state when current mode is source         */
  HAL_UCPD_VSTATE_SRC_VOPEN    = 2U, /*!< CCx voltage corresponds to an open state when current mode is source       */
  HAL_UCPD_VSTATE_SRC_INVALID  = 3U, /*!< CCx voltage corresponds to an invalid state when current mode is source    */
  HAL_UCPD_VSTATE_SNK_VRA      = 4U, /*!< CCx voltage corresponds to an Ra state when current mode is sink           */
  HAL_UCPD_VSTATE_SNK_VRPDFLT  = 5U, /*!< CCx voltage corresponds to an Rp default state when current mode is sink   */
  HAL_UCPD_VSTATE_SNK_VRP15A   = 6U, /*!< CCx voltage corresponds to an Rp 1.5A state when current mode is sink      */
  HAL_UCPD_VSTATE_SNK_VRP30A   = 7U  /*!< CCx voltage corresponds to an Rp 3.0A state when current mode is sink      */
} hal_ucpd_vstate_t;

/**
  * @brief HAL UCPD instance
  */
typedef enum
{
#if defined(UCPD1)
  HAL_UCPD1 = (uint32_t)UCPD1, /*!< Peripheral instance UCPD1 */
#endif /* UCPD1 */
} hal_ucpd_t;

typedef struct hal_ucpd_handle_s hal_ucpd_handle_t; /*!< UCPD handle type definition */

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
/**
  * @brief Pointer to a UCPD callback functions
  */
typedef  void (*hal_ucpd_cb_t)(hal_ucpd_handle_t *hucpd);

/**
  * @brief Pointer to a UCPD CC event callback functions
  */
typedef  void (*hal_ucpd_cc_event_cb_t)(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

/**
  * @brief UCPD Handle Structure Definition
  */
struct hal_ucpd_handle_s
{
  hal_ucpd_t                instance;              /*!< Peripheral instance       */
  volatile hal_ucpd_state_t global_state;          /*!< Peripheral state          */

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  volatile hal_ucpd_state_t previous_state;        /*!< Peripheral previous state */

  uint8_t                   *p_buf_rx;             /*!< Rx transfer buffer        */
  const uint8_t             *p_buf_tx;             /*!< Tx transfer buffer        */

  uint16_t                  buff_goodcrc;          /*!< GoodCRC buffer (2 bytes)  */

  hal_dma_handle_t          *hdma_tx;              /*!< Tx DMA handle             */
  hal_dma_handle_t          *hdma_rx;              /*!< Rx DMA handle             */
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

#if defined(USE_HAL_UCPD_USER_DATA) && (USE_HAL_UCPD_USER_DATA == 1)
  const void                *p_user_data;          /*!< User Data Pointer         */
#endif /* USE_HAL_UCPD_USER_DATA */

#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hal_ucpd_cb_t             p_tx_cplt_cb;          /*!< Tx message sent callback               */
  hal_ucpd_cb_t             p_tx_goodcrc_cplt_cb;  /*!< Tx GoodCRC message sent callback       */
  hal_ucpd_cb_t             p_tx_discard_cb;       /*!< Tx message discarded callback          */
  hal_ucpd_cb_t             p_tx_abort_cb;         /*!< Tx message aborted callback            */
  hal_ucpd_cb_t             p_rx_cptl_cb;          /*!< Rx complete callback                   */
  hal_ucpd_cb_t             p_rx_ord_set_cb;       /*!< Rx ordered set detected callback       */
  hal_ucpd_cb_t             p_hrst_sent_cb;        /*!< Hard reset sent callback               */
  hal_ucpd_cb_t             p_hrst_rx_cb;          /*!< Hard reset received callback           */
  hal_ucpd_cb_t             p_hrst_discard_cb;     /*!< Hard reset discarded callback          */
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hal_ucpd_cc_event_cb_t    p_type_c_event_ccx_cb; /*!< Type-C event on CCx callback           */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
  hal_ucpd_cb_t             p_frs_evt_cb;          /*!< Fast Role Swap event detected callback */
  hal_ucpd_cb_t             p_abort_cplt_cb;       /*!< Abort complete callback                */
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
  hal_ucpd_cb_t             p_error_cb;            /*!< Error callback                         */
#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

