STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.h
#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
  volatile uint32_t         last_error_codes;      /*!< Last error codes. This variable is a
                                                        bitfield of type @ref UCPD_Error_Code  */
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
  hal_os_semaphore_t        semaphore;             /*!< OS semaphore              */
#endif /* USE_HAL_MUTEX */
};

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup UCPD_Exported_Functions UCPD Exported Functions
  * @{
  */

/** @defgroup UCPD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

hal_status_t HAL_UCPD_Init(hal_ucpd_handle_t *hucpd, hal_ucpd_t instance);
void HAL_UCPD_DeInit(hal_ucpd_handle_t *hucpd);

/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group2 Configuration functions
  * @{
  */

/* Global configuration */
hal_status_t HAL_UCPD_SetConfig(hal_ucpd_handle_t *hucpd, const hal_ucpd_config_t *p_config);
void HAL_UCPD_GetConfig(const hal_ucpd_handle_t *hucpd, hal_ucpd_config_t *p_config);

/* Rx Ordered Sets */
hal_status_t HAL_UCPD_SetRxOrderedSet(hal_ucpd_handle_t *hucpd, uint32_t rx_ordered_set);
uint32_t HAL_UCPD_GetRxOrderedSet(hal_ucpd_handle_t *hucpd);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* Rx DMA */
hal_status_t HAL_UCPD_SetRxDMA(hal_ucpd_handle_t *hucpd, hal_dma_handle_t *hdma_rx);

/* Tx DMA */
hal_status_t HAL_UCPD_SetTxDMA(hal_ucpd_handle_t *hucpd, hal_dma_handle_t *hdma_tx);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/* Rx analog filter */
hal_status_t HAL_UCPD_EnableRxAnalogFilter(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableRxAnalogFilter(hal_ucpd_handle_t *hucpd);
hal_ucpd_rx_analog_filter_status_t HAL_UCPD_IsEnabledRxAnalogFilter(hal_ucpd_handle_t *hucpd);

/* Wakeup */
hal_status_t HAL_UCPD_EnableWakeupMode(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableWakeupMode(hal_ucpd_handle_t *hucpd);
hal_ucpd_wakeup_mode_status_t HAL_UCPD_IsEnabledWakeupMode(hal_ucpd_handle_t *hucpd);

/* ClkReq clock request forcing */
hal_status_t HAL_UCPD_EnableForceClock(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableForceClock(hal_ucpd_handle_t *hucpd);
hal_ucpd_force_clk_status_t HAL_UCPD_IsEnabledForceClock(hal_ucpd_handle_t *hucpd);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* BMC decoder Rx pre-filter sampling method */
hal_status_t HAL_UCPD_SetRxPreFilterSampling(hal_ucpd_handle_t *hucpd,
                                             hal_ucpd_rx_prefilter_samples_t rx_prefilter_samples);
hal_ucpd_rx_prefilter_samples_t HAL_UCPD_GetRxPreFilterSampling(hal_ucpd_handle_t *hucpd);

/* BMC decoder Rx pre-filter */
hal_status_t HAL_UCPD_EnableRxPreFilter(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableRxPreFilter(hal_ucpd_handle_t *hucpd);
hal_ucpd_rx_prefilter_status_t HAL_UCPD_IsEnabledRxPreFilter(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/* Software trimming of Rp and Rd resistors */
hal_status_t HAL_UCPD_ApplyTrimmingRp(hal_ucpd_handle_t *hucpd, hal_ucpd_trim_rp_value_t trim_rp_value);
hal_status_t HAL_UCPD_ApplyTrimmingRd(hal_ucpd_handle_t *hucpd);

/* Start/Stop */
hal_status_t HAL_UCPD_Start(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_Stop(hal_ucpd_handle_t *hucpd);
/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group3 Control functions
  * @{
  */

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* Rx PHY */
hal_status_t HAL_UCPD_EnableRx(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableRx(hal_ucpd_handle_t *hucpd);
hal_ucpd_rx_phy_status_t HAL_UCPD_IsEnabledRx(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/* Type-C detector */
hal_status_t HAL_UCPD_EnableTypeCDetectorCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);
hal_status_t HAL_UCPD_DisableTypeCDetectorCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);
hal_ucpd_type_c_detector_status_t HAL_UCPD_IsEnabledTypeCDetectorCCx(hal_ucpd_handle_t *hucpd,
                                                                     hal_ucpd_cc_line_t cc_line);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* Vconn discharge */
hal_status_t HAL_UCPD_EnableVconnDischarge(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableVconnDischarge(hal_ucpd_handle_t *hucpd);
hal_ucpd_vconn_discharge_status_t HAL_UCPD_IsEnabledVconnDischarge(hal_ucpd_handle_t *hucpd);

/* Tx ordered set */
hal_status_t HAL_UCPD_SetTxOrderedSet(hal_ucpd_handle_t *hucpd, hal_ucpd_tx_ordered_set_t tx_ordered_set);
hal_ucpd_tx_ordered_set_t HAL_UCPD_GetTxOrderedSet(hal_ucpd_handle_t *hucpd);

/* Tx mode */
hal_status_t HAL_UCPD_SetTxMode(hal_ucpd_handle_t *hucpd, hal_ucpd_tx_mode_t tx_mode);
hal_ucpd_tx_mode_t HAL_UCPD_GetTxMode(hal_ucpd_handle_t *hucpd);

/* Rx mode */
hal_status_t HAL_UCPD_SetRxMode(hal_ucpd_handle_t *hucpd, hal_ucpd_rx_mode_t rx_mode);
hal_ucpd_rx_mode_t HAL_UCPD_GetRxMode(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/* PHY operating role */
hal_status_t HAL_UCPD_SetRole(hal_ucpd_handle_t *hucpd, hal_ucpd_role_t role);
hal_ucpd_role_t HAL_UCPD_GetRole(hal_ucpd_handle_t *hucpd);

/* Pull-ups (Rp) resistors */
hal_status_t HAL_UCPD_SetRp(hal_ucpd_handle_t *hucpd, hal_ucpd_rp_value_t rp_value);
hal_ucpd_rp_value_t HAL_UCPD_GetRp(hal_ucpd_handle_t *hucpd);

/* CC line enabling */
hal_status_t HAL_UCPD_SetCCLines(hal_ucpd_handle_t *hucpd, const hal_ucpd_cc_enable_t cc_enable);
hal_ucpd_cc_enable_t HAL_UCPD_GetCCLines(const hal_ucpd_handle_t *hucpd);

/* Active CC line */
hal_status_t HAL_UCPD_SetActiveCC(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);
hal_ucpd_cc_line_t HAL_UCPD_GetActiveCC(hal_ucpd_handle_t *hucpd);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* Fast Role Swap Rx */
hal_status_t HAL_UCPD_EnableFRS_Rx(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableFRS_Rx(hal_ucpd_handle_t *hucpd);
hal_ucpd_frs_rx_status_t HAL_UCPD_IsEnabledFRS_Rx(hal_ucpd_handle_t *hucpd);

/* Fast Role Swap Tx */
hal_status_t HAL_UCPD_SendFRS(hal_ucpd_handle_t *hucpd);

