STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_ucpd.h
/* Cable reset Tx */
hal_status_t HAL_UCPD_SendCableReset(hal_ucpd_handle_t *hucpd);

/* Hard reset Tx */
hal_status_t HAL_UCPD_SendHardReset(hal_ucpd_handle_t *hucpd);

/* Hard reset Rx */
hal_status_t HAL_UCPD_EnableHardReset_Rx(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_DisableHardReset_Rx(hal_ucpd_handle_t *hucpd);
hal_ucpd_hard_reset_rx_status_t HAL_UCPD_IsEnabledHardReset_Rx(hal_ucpd_handle_t *hucpd);

/* BIST */
hal_status_t HAL_UCPD_SendBIST(hal_ucpd_handle_t *hucpd);
hal_status_t HAL_UCPD_StopBIST(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group4 Status functions
  * @{
  */

/* CC line voltage status */
hal_ucpd_vstate_t HAL_UCPD_GetTypeCVoltageLevelCCx(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
/* Detected Rx ordered set */
hal_ucpd_detected_rx_ordered_set_t HAL_UCPD_GetDetectedRxOrderedSet(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */

/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group5 IO operation functions
  * @{
  */
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
hal_status_t HAL_UCPD_Transmit_DMA(hal_ucpd_handle_t *hucpd, const void *p_data, uint32_t size_byte);
hal_status_t HAL_UCPD_Receive_DMA(hal_ucpd_handle_t *hucpd, void *p_data, uint32_t size_byte);

hal_status_t HAL_UCPD_Abort_IT(hal_ucpd_handle_t *hucpd);

hal_status_t HAL_UCPD_SetGoodCRCData(hal_ucpd_handle_t *hucpd, uint16_t goodcrc_data);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group6 IRQHandler and Callbacks functions
  * @{
  */

void HAL_UCPD_IRQHandler(hal_ucpd_handle_t *hucpd);

#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
void HAL_UCPD_TxCpltCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_TxGoodCRCCpltCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_TxDiscardCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_TxAbortCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_RxCpltCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_RxOrdDetCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_HRstSentCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_HRstRxCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_HRstDiscardCallback(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
void HAL_UCPD_TypeCEventCCxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_line_t cc_line);
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
void HAL_UCPD_FRSEvtCallback(hal_ucpd_handle_t *hucpd);
void HAL_UCPD_AbortCpltCallback(hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
void HAL_UCPD_ErrorCallback(hal_ucpd_handle_t *hucpd);


#if defined(USE_HAL_UCPD_REGISTER_CALLBACKS) && (USE_HAL_UCPD_REGISTER_CALLBACKS == 1)
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
hal_status_t HAL_UCPD_RegisterTxCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterTxGoodCRCCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterTxDiscardCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterTxAbortCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterRxCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterRxOrdDetCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterHRstSentCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterHRstRxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterHRstDiscardCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
hal_status_t HAL_UCPD_RegisterTypeCEventCCxCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cc_event_cb_t p_callback);
#if defined(USE_HAL_UCPD_POWER_DELIVERY) && (USE_HAL_UCPD_POWER_DELIVERY == 1)
hal_status_t HAL_UCPD_RegisterFRSEvtCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
hal_status_t HAL_UCPD_RegisterAbortCpltCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);
#endif /* USE_HAL_UCPD_POWER_DELIVERY */
hal_status_t HAL_UCPD_RegisterErrorCallback(hal_ucpd_handle_t *hucpd, hal_ucpd_cb_t p_callback);

#endif /* USE_HAL_UCPD_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup UCPD_Exported_Functions_Group7 Peripheral State, Error functions
  * @{
  */

hal_ucpd_state_t HAL_UCPD_GetState(const hal_ucpd_handle_t *hucpd);

#if defined(USE_HAL_UCPD_GET_LAST_ERRORS) && (USE_HAL_UCPD_GET_LAST_ERRORS == 1)
uint32_t HAL_UCPD_GetLastErrorCodes(const hal_ucpd_handle_t *hucpd);
#endif /* USE_HAL_UCPD_GET_LAST_ERRORS */

/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup UCPD_Exported_Functions_Group8 Acquire/Release the bus
  * @{
  */

hal_status_t HAL_UCPD_AcquireBus(hal_ucpd_handle_t *hucpd, uint32_t timeout_ms);
hal_status_t HAL_UCPD_ReleaseBus(hal_ucpd_handle_t *hucpd);

/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined(USE_HAL_UCPD_USER_DATA) && (USE_HAL_UCPD_USER_DATA == 1)
/** @defgroup UCPD_Exported_Functions_Group9 Set/Get user data
  * @{
  */

void HAL_UCPD_SetUserData(hal_ucpd_handle_t *hucpd, const void *p_user_data);
const void *HAL_UCPD_GetUserData(const hal_ucpd_handle_t *hucpd);

/**
  * @}
  */

#endif /* USE_HAL_UCPD_USER_DATA */
/**
  * @}
  */

/**
  * @}
  */

#endif /* UCPD1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_HAL_UCPD_H */
